#include "Some_Functions.h"

/*******************************************************************************************************
阶跃函
********************************************************************************************************/
//ref  : 输入值
//*out : 输出量
//sens : 灵敏度
float Ramp_Function(float ref,float *out,float sens)
{
	static float error = 0;
	
	error = ref - *out;
	
	if(ref == 0)
	{
		if(fabs(error)<0.00006f) *out = 0;
		else *out += error*sens;
	}
	else *out += error*sens;
	
	return *out;
}

/*******************************************************************************************************
以正数输出
********************************************************************************************************/
float Positive_Number_Out(float num)
{
	if(num>=0) {num = num;}
	else {num = 0;}
	return num;
}

/*******************************************************************************************************
检测数值是否长时不再发生改变
********************************************************************************************************/
//*num      : 0当前数值 1前一次数值 2不变时间 (需要建立[3]型数组)
//time_thre : 超时阈值
bool Check_If_Unchange(int *num,int time_thre)
{
	if(num[0] == num[1]) num[2]++;
	else 
	{
		num[2]--;
		if(num[2]<=0) num[2] = 0;
	}
	
	num[1] = num[0];
	
	if(num[2] >= time_thre)
	{
		num[2] = time_thre-1;
		return 1;
	}
	else return 0;
}

/*******************************************************************************************************
均值滤波
********************************************************************************************************/
float Mean_Filtering(float input,float *aver)
{
	aver[0]=aver[1]; aver[1]=aver[2];
	aver[2]=aver[3]; aver[3]=input;
	
	return ( 0.25f*aver[0]+0.25f*aver[1]
					+0.25f*aver[2]+0.25f*aver[3]);
}

/*******************************************************************************************************
最大输出限制
********************************************************************************************************/
float Max_Output(float num,float max)
{
	if(num>=max) return max;
	else if(num<=-max) return -max;
	else return num;
}

/*******************************************************************************************************
最小输出限制
********************************************************************************************************/
float Min_Output(float num,float min)
{
	if(num>=min) return num;
	else return min;
}

/*******************************************************************************************************
到指定最小数值再进行输出
********************************************************************************************************/
int16_t Limit_Min(int16_t num,int min)
{
	if(num<-min || num>min) return num;
	else return 0;
}

/*******************************************************************************************************
弧度制半圆输出
********************************************************************************************************/
float Half_Circle_RADIAN(float num)
{
	if(num >= PI) num = num - 2*PI;
	else if(num <= -PI) num = num + 2*PI;

	return num;
}

/*******************************************************************************************************
角度制整圆输出
********************************************************************************************************/
int Whole_Circle_ANGLE(int num)
{
	if(num>360) num = num - 360;
	else if(num<0) num = 360 + num;
	return num;
}

/*******************************************************************************************************
弧度制整圆输出
********************************************************************************************************/
float Whole_Circle_RADIAN(float num)
{
	if(num>2*PI) num = num - 2*PI;
	else if(num<0) num = 2*PI + num;
	return num;
}

/*******************************************************************************************************
寻找最小弧度
********************************************************************************************************/
float Find_Min_RADIAN(float measure, float ref)
{
	static float a = 0,b = 0;
	static float min;
	
	if(measure>0 && ref<0)
	{
		a= 2*PI-measure+ref;
		b=ref-measure;
		(a<-b)?(min=a):(min=b);
	}
	else if(measure<0 && ref>0)
	{
		a=-2*PI-measure+ref;
		b=ref-measure;
		(-a<b)?(min=a):(min=b);
	}
	else
	{
		min = ref - measure;
	}
	
	return min;
}

/*******************************************************************************************************
寻找最小角度
********************************************************************************************************/
float Find_Min_Angle(float measure, float ref)
{
	static float a = 0,b = 0;
	static float min;
	
	if(measure>0 && ref<0)
	{
		a= 360-measure+ref;
		b=ref-measure;
		(a<-b)?(min=a):(min=b);
	}
	else if(measure<0 && ref>0)
	{
		a=-360-measure+ref;
		b=ref-measure;
		(-a<b)?(min=a):(min=b);
	}
	else
	{
		min = ref - measure;
	}
	
	return min;
}
