#include "LQR.h"

//定腿长下增益矩阵
//     -1.0372,  -2.5505,  -5.238,  -0.95501,  -19.426,  -0.84491,  -2.6521,  -0.33033,  -14.171,  -1.9019
//     -1.0372,  -2.5505,  5.238,  0.95501,  -2.6521,  -0.33033,  -19.426,  -0.84491,  -14.171,  -1.9019
//     1.6789,  4.0364,  -24.216,  -5.0734,  47.552,  1.8287,  -9.5701,  -0.060787,  -54.025,  -5.969
//     1.6789,  4.0364,  24.216,  5.0734,  -9.5701,  -0.060787,  47.552,  1.8287,  -54.025,  -5.969

//变腿长下多项式拟合的全部系数
float P[40][6] = 
{ 
		 -0.8773,  -6.6633,  5.637,  10.728,  -4.8341,  -5.0894       ,
     -2.7445,  -14.28,  16.342,  27.193,  -18.672,  -13.913       ,
     -10.73,  45.182,  -11.792,  -57.676,  27.376,  13.344        ,
     -1.9148,  8.6392,  -3.4349,  -9.8042,  6.0135,  4.3875       ,
     -7.9236,  -89.163,  9.3534,  111.35,  -10.234,  -11.247      ,
     -0.44683,  -3.3359,  1.2689,  -0.012558,  0.73617,  -1.6261  ,
     -3.391,  7.378,  -6.0813,  -7.0378,  18.429,  3.4081         ,
     -0.22929,  -0.35612,  0.043282,  2.3568,  -4.8036,  1.0387   ,
     -23.316,  22.933,  38.731,  28.636,  -46.138,  -42.099       ,
     -3.3543,  2.9314,  7.3208,  4.513,  -8.7168,  -7.9397        ,
     -0.8773,  5.637,  -6.6633,  -5.0894,  -4.8341,  10.728       ,
     -2.7445,  16.342,  -14.28,  -13.913,  -18.672,  27.193       ,
     10.73,  11.792,  -45.182,  -13.344,  -27.376,  57.676        ,
     1.9148,  3.4349,  -8.6392,  -4.3875,  -6.0135,  9.8042       ,
     -3.391,  -6.0813,  7.378,  3.4081,  18.429,  -7.0378         ,
     -0.22929,  0.043282,  -0.35612,  1.0387,  -4.8036,  2.3568   ,
     -7.9236,  9.3534,  -89.163,  -11.247,  -10.234,  111.35      ,
     -0.44683,  1.2689,  -3.3359,  -1.6261,  0.73617,  -0.012558  ,
     -23.316,  38.731,  22.933,  -42.099,  -46.138,  28.636       ,
     -3.3543,  7.3208,  2.9314,  -7.9397,  -8.7168,  4.513        ,
     2.2009,  4.5389,  -7.17,  -23.108,  15.766,  5.3039          ,
     6.3146,  6.6661,  -21.555,  -53.654,  50.562,  14.199        ,
     -7.17,  -91.059,  -39.557,  175.63,  -35.61,  63.877         ,
     -1.0206,  -21.23,  -8.4847,  38.867,  -11.787,  13.746       ,
     55.526,  -58.474,  9.9243,  4.1003,  42.061,  -22.235        ,
     2.1758,  -1.856,  -0.79487,  0.44382,  3.6947,  0.12407      ,
     -1.2983,  -37.631,  -15.034,  58.735,  -23.958,  -0.74682    ,
     -0.23695,  -0.46652,  2.3683,  -3.0126,  2.2552,  -4.8017    ,
     -30.778,  -238.41,  65.697,  277.13,  55.174,  -90.17        ,
     -3.0219,  -29.845,  7.8708,  30.549,  11.901,  -11.313       ,
     2.2009,  -7.17,  4.5389,  5.3039,  15.766,  -23.108          ,
     6.3146,  -21.555,  6.6661,  14.199,  50.562,  -53.654        ,
     7.17,  39.557,  91.059,  -63.877,  35.61,  -175.63           ,
     1.0206,  8.4847,  21.23,  -13.746,  11.787,  -38.867         ,
     -1.2983,  -15.034,  -37.631,  -0.74682,  -23.958,  58.735    ,
     -0.23695,  2.3683,  -0.46652,  -4.8017,  2.2552,  -3.0126    ,
     55.526,  9.9243,  -58.474,  -22.235,  42.061,  4.1003        ,
     2.1758,  -0.79487,  -1.856,  0.12407,  3.6947,  0.44382      ,
     -30.778,  65.697,  -238.41,  -90.17,  55.174,  277.13        ,
     -3.0219,  7.8708,  -29.845,  -11.313,  11.901,  30.549
};

//定义控制矩阵
float u[10];

//定义拟合增益矩阵
float Fitting_K[4][10];

void Fitting_K_Calc(float (*fitting_k)[10],float (*p)[6],float L_l,float L_r)
{
	static unsigned short int i = 0;
	static unsigned short int j = 0;
	
	for(i=0;i<=3;i++)
	{
		for(j=0;j<=9;j++)
		{
			fitting_k[i][j] = p[i*10+j][0] + p[i*10+j][1]*L_l + p[i*10+j][2]*L_r + p[i*10+j][3]*(L_l*L_l) + p[i*10+j][4]*L_l*L_r + p[i*10+j][5]*(L_r*L_r);
		}
	}
}

void LQR_Calc(Flag_Bit_t *flag,
							Goal_Setting_t *goal,
							Compensation_Amount_t *comp,
							Body_Current_Situation_t *body,
							Leg_Current_Situation_t *leg[2],
							Joint_Motor_Status_t *joint_m[2])
{
	//bz:|0,T_wl|1,T_wr|2,T_bl|3,T_br|
	static float T[4];
	static unsigned short int i = 0;
	
	u[0] = Max_Output(comp->Gravity_Comp_X      -        body->x,      X_MAX); u[1] =   goal->d_x_t -       body->d_x;
	u[2] = Max_Output(Find_Min_RADIAN(body->abs_yaw,goal->yaw_t),    Yaw_MAX); u[3] = goal->d_yaw_t -     body->d_yaw;
	u[4] = Max_Output(comp->Gravity_Comp_Theta  -  leg[0]->theta,Theta_L_MAX); u[5] =             0 - leg[0]->d_theta;
	u[6] = Max_Output(comp->Gravity_Comp_Theta  -  leg[1]->theta,Theta_R_MAX); u[7] =             0 - leg[1]->d_theta;
	u[8] = Max_Output(                       0  -    body->theta,Theta_B_MAX); u[9] =             0 -   body->d_theta;
	
	//打滑取消YAW增益提高腿杆THETA增益
	if(flag->slip_flag[0]||flag->slip_flag[1]) 
	{
		if(flag->slip_flag[0])
		{
			Fitting_K[0][2] = 0; Fitting_K[0][3] = 0; 					
			Fitting_K[2][2] = 0; Fitting_K[2][3] = 0; 	
			
			Fitting_K[0][4] = Fitting_K[0][4]*2.0f; Fitting_K[0][6] = Fitting_K[0][6]*2.0f; 
			Fitting_K[2][4] = Fitting_K[2][4]*2.0f; Fitting_K[2][6] = Fitting_K[2][6]*2.0f;
		}
		if(flag->slip_flag[1])
		{
			Fitting_K[1][2] = 0; Fitting_K[1][3] = 0; 					
			Fitting_K[3][2] = 0; Fitting_K[3][3] = 0; 	
			
			Fitting_K[1][4] = Fitting_K[1][4]*2.0f; Fitting_K[1][6] = Fitting_K[1][6]*2.0f; 
			Fitting_K[3][4] = Fitting_K[3][4]*2.0f; Fitting_K[3][6] = Fitting_K[3][6]*2.0f;
		}
	}
	
	//腿杆异常取消YAW增益提高腿杆THETA增益
	if(flag->theta_flag[0]||flag->theta_flag[1]) 
	{
		if(flag->theta_flag[0])
		{
			Fitting_K[0][2] = 0; Fitting_K[0][3] = 0; 					
			Fitting_K[2][2] = 0; Fitting_K[2][3] = 0; 	
			
			Fitting_K[0][4] = Fitting_K[0][4]*2.0f; Fitting_K[0][6] = Fitting_K[0][6]*2.0f; 
			Fitting_K[2][4] = Fitting_K[2][4]*2.0f; Fitting_K[2][6] = Fitting_K[2][6]*2.0f;
		}
		if(flag->theta_flag[1])
		{
			Fitting_K[1][2] = 0; Fitting_K[1][3] = 0; 					
			Fitting_K[3][2] = 0; Fitting_K[3][3] = 0; 	
			
			Fitting_K[1][4] = Fitting_K[1][4]*2.0f; Fitting_K[1][6] = Fitting_K[1][6]*2.0f; 
			Fitting_K[3][4] = Fitting_K[3][4]*2.0f; Fitting_K[3][6] = Fitting_K[3][6]*2.0f;
		}
	}

	for(i=0;i<=3;i++)
	{
		if(!flag->off_flag) 
		{
			if(!flag->spinning_flag) 
			{
				T[i] = u[0]*Fitting_K[i][0] + u[1]*Fitting_K[i][1]
						 - u[2]*Fitting_K[i][2] + u[3]*Fitting_K[i][3]
						 + u[4]*Fitting_K[i][4] + u[5]*Fitting_K[i][5] 
						 + u[6]*Fitting_K[i][6] + u[7]*Fitting_K[i][7] 
						 + u[8]*Fitting_K[i][8] + u[9]*Fitting_K[i][9];	
			}
			else //小陀螺取消X位移,YAW位置增益
			{
				T[i] =                    0      + u[1]*Fitting_K[i][1] 
						 -                    0      + u[3]*Fitting_K[i][3]*1.2f
						 + u[4]*Fitting_K[i][4]*1.4f + u[5]*Fitting_K[i][5]*1.0f
						 + u[6]*Fitting_K[i][6]*1.4f + u[7]*Fitting_K[i][7]*1.0f
						 + u[8]*Fitting_K[i][8]*3.0f + u[9]*Fitting_K[i][9]*1.6f;
			}
		}
		else //离地时只控制腿杆垂直
		{
			T[i] = u[4]*Fitting_K[i][4] + u[5]*Fitting_K[i][5] 
					 + u[6]*Fitting_K[i][6] + u[7]*Fitting_K[i][7];
		}
	}

	//输出赋值
	joint_m[0]->T_Wheel = T[0]; joint_m[1]->T_Wheel = T[1];
	joint_m[0]->Tp      = T[2]; joint_m[1]->Tp      = T[3];	
}








